// 3. Создать приложение, выводящее n строк с переходом и без перехода на новую строку.

public class Main {
    public static void main(String[] args) {
        System.out.printf("Hello and welcome!");

        for (int i = 1; i < args.length; i++) {
            System.out.println("iiiiii = " + args[i]);
        }
    }
}
