// Во входном файле расположены два набора положительных чисел;
// между наборами стоит отрицательное число. Построить два списка C1 и С2,
// элементы которых содержат соответственно числа 1-го и 2-го набора таким образом,
// чтобы внутри одного списка числа были упорядочены по возрастанию.
// Затем объединить списки C1 и С2 в один упорядоченный список, изменяя только значения
// полей ссылочного типа.

import java.util.HashMap;

public class Main {
    public static void main(String[] args) {
        HashMap<Integer, Integer> polynomial1 = new HashMap<>();
        HashMap<Integer, Integer> polynomial2 = new HashMap<>();
    }

}